app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all(:order=>"created_at DESC")

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."post_id" = 1)
---
  def show
    @post = Post.find(params[:id])
    @comments = Comment.find(:all, :conditions => ["post_id=?",params[:id]])

INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "user_id", "category_id") VALUES('2009-09-21 23:04:33', 'post x', 'body for post x', '2009-09-21 23:04:33', NULL, 1)
---
  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save